app/Actions/CreateOrderAction.php

insert into `orders` (`reference`, `currency`, `state`, `total`, `user_id`, `updated_at`, `created_at`) values ('\"9fcb788a-b632-4258-a576-2f361f137192\"', 'COP', 'PENDING', 348439, 1, '2022-04-27 00:36:45', '2022-04-27 00:36:45')
---
    public static function create(): Order
    {
        $cart = Cart::content();
        $order = new Order();

        $order->reference = Str::uuid();
        $order->currency = 'COP';
        $order->state = 'PENDING';
        $order->total = (int) Cart::priceTotalFloat();
        $order->user_id = Auth::user()->id;

        $order->save();