app/Http/Controllers/CartController.php

select * from `products` where `products`.`id` = '16' limit 1
---
    public function store(AddProductToCartRequest $request): RedirectResponse
    {
        $product = Product::findOrFail($request->input('product_id'));