app/Http/Controllers/OrderController.php

    public function index(): View
    {
        $orders = Order::where('user_id', auth()->user()->id)->get();
---
select * from `orders` where `user_id` = 1

    public function show(Order $order, WebcheckoutService $webcheckoutService): View
    {
        if ($order->state === States::PENDING || $order->state === States::REJECTED) {
            $response = $webcheckoutService->getInformation($order->session_id);

            if ($response['status']['status'] !== States::PENDING) {
                $order->state = $response['status']['status'];

                $order->save();
---
update `orders` set `state` = 'APPROVED', `orders`.`updated_at` = '2022-04-27 00:38:36' where `id` = 1

    public function store(WebcheckoutService $webcheckoutService, CreateSessionAction $createSessionAction): RedirectResponse
    {
        $order = CreateOrderAction::create();

        $response = $createSessionAction::execute($webcheckoutService, $order);

        $order->session_id = $response['requestId'];
        $order->process_url = $response['processUrl'];

        $order->save();
---
update `orders` set `session_id` = 53764, `process_url` = 'https://checkout-co.placetopay.dev/session/53764/923cd7b6e144c605a32b3622a72a6837', `orders`.`updated_at` = '2022-04-27 00:36:46' where `id` = 1