app/Http/Controllers/ProductsController.php

update `products` set `enable` = 1, `products`.`updated_at` = '2022-04-27 00:37:20' where `id` = 2
---
    public function toggle(Product $product): RedirectResponse
    {
        $product->enable = !$product->enable;

        $product->save();